БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаРедактированияШаблонов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Режим",Режим);
	Если (НЕ ЗначениеЗаполнено(Режим)) Тогда
		Режим="Номенклатура";		
	КонецЕсли; 
	Шаблон = Параметры.Шаблон;
	// --- 
	Если (Режим="Номенклатура") Тогда
		Макросы = CW_Шаблоны.СписокМакросовШаблоновНоменклатуры(Параметры.РасходнаяСтатья,Параметры.ДоходнаяСтатья);	
		Макросы = ПолучитьВнешниеМакросы(Макросы);
	ИначеЕсли (Режим="СтатусыОборудования") Тогда 
		Макросы = CW_Шаблоны.СписокМакросовШаблоновСтатусовОборудования();	
	КонецЕсли; 
	
	Для каждого Элемент Из Макросы Цикл
		
		Нстр = ТаблицаМакросов.Добавить();
		Нстр.Макрос = Элемент.Значение;
		Нстр.Описание = Элемент.Представление;
		
	КонецЦикла; 
	
	Попытка
		ДобавитьКомандыПеревода();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст  = "Не удалось создать кнопку ""Переводы"". Провертье корректность кодов справочника ""Языки""";
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомандыПеревода()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Языки.Код КАК Код,
	               |	CW_Языки.Ссылка КАК Ссылка,
	               |	CW_Языки.Представление КАК Представление
	               |ИЗ
	               |	Справочник.CW_Языки КАК CW_Языки
	               |ГДЕ
	               |	НЕ CW_Языки.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_БезПеревода");
	ПараметрыКоманды.Вставить("Действие"	, "УстановитьПризнакПеревода");
	ПараметрыКоманды.Вставить("Заголовок"	, "<Без перевода>");
	//ПараметрыКоманды.Вставить("Картинка"	, Новый Картинка);
	
	ПараметрыКнопки = новый Структура;
	ПараметрыКнопки.Вставить("Имя"			, "Кнопка_БезПеревода");
	ПараметрыКнопки.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_БезПеревода");
	ПараметрыКнопки.Вставить("Заголовок"	, "<Без перевода>");
	
	ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки);

	Пока Выборка.Следующий() Цикл
		
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_"+Выборка.Код);
		ПараметрыКоманды.Вставить("Действие"	, "УстановитьПризнакПеревода");
		ПараметрыКоманды.Вставить("Заголовок"	, Выборка.Представление + " (" + СокрЛП(Выборка.Ссылка.Наименование) + ")");
		//ПараметрыКоманды.Вставить("Картинка"	, БиблиотекаКартинок.CW_Страны);
		//ПараметрыКоманды.Вставить("Картинка"	, Новый Картинка);
		
		ПараметрыКнопки = новый Структура;
		ПараметрыКнопки.Вставить("Имя"			, "Кнопка_" + Выборка.Код);
		ПараметрыКнопки.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_"+Выборка.Код);
		ПараметрыКнопки.Вставить("Заголовок"	, );
		
		ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки);
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки)
	//Добавить кнопку "<Без переовда>"
	
	НоваяКомандаФормы = ЭтаФорма.Команды.Добавить(ПараметрыКоманды.ИмяКоманды);
	НоваяКомандаФормы.Действие 	= ПараметрыКоманды.Действие;
	НоваяКомандаФормы.Заголовок = ПараметрыКоманды.Заголовок;    
	//НоваяКомандаФормы.Картинка  = ПараметрыКоманды.Картинка;
	
	// создадим кнопку
	НовыйЭлемент        = Элементы.Добавить(ПараметрыКнопки.Имя 					,  	// Первый параметр - имя кнопки
	Тип("КнопкаФормы")																,  	// Второй параметр - тип элемента управления
	Элементы.ТаблицаМакросов.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаПереводы	)	;	// Третий параметр - место расположения на форме
	
	НовыйЭлемент.Вид    		= ВидКнопкиФормы.ОбычнаяКнопка; // вид кнопки
	НовыйЭлемент.Заголовок  	= ПараметрыКнопки.Заголовок;
	НовыйЭлемент.ИмяКоманды 	= ПараметрыКнопки.ИмяКоманды;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакПеревода(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаМакросов.ТекущаяСтрока; 
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодЯзыка = СтрЗаменить(Команда.Имя,"УстановитьПризнакПеревода_",""); 
	Если не ЕстьСсылкаНаСправочник(КодЯзыка) Тогда
		КодЯзыка = "";	
	КонецЕсли;

	ПередНачаломВыбораМакроса(ТекущаяСтрока, КодЯзыка);
	
КонецПроцедуры

&НаСервере
Функция ЕстьСсылкаНаСправочник(КодЯзыка)
	
	СсылкаНаЭлемент = Справочники.CW_Языки.НайтиПоКоду(КодЯзыка);
	
	Возврат НЕ СсылкаНаЭлемент.Пустая();
	
КонецФункции

&НаКлиенте
Процедура ТаблицаМакросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ПередНачаломВыбораМакроса(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломВыбораМакроса(Знач ВыбраннаяСтрока, Знач КодЯзыка="")
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
	ДополнительныеПараметры.Вставить("КодЯзыка", КодЯзыка);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборЗначенияПараметра", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Значение", 	"Значение");
	СписокВыбора.Добавить("План", 		"План");
	СписокВыбора.Добавить("Факт", 		"Факт");  
	
	Если ЭтоМакросКонтрольнойДаты(ВыбраннаяСтрока) Тогда
		СписокВыбора.ПоказатьВыборЭлемента(Оповещение, "Выберите значение контрольной даты");  
	Иначе
		ЭлементСписка = СписокВыбора.Получить(0);	
		ВыполнитьОбработкуОповещения(Оповещение, ЭлементСписка);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьВыборЗначенияПараметра(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонеЦЕсли;
	
	Постфикс 	= ?(ЭлементСписка.Значение = "Значение", "", "."+ЭлементСписка.Значение);
	Макрос 		= ИмяМакроса(ДополнительныеПараметры.ВыбраннаяСтрока);
	
	ДобавитьМакрос(Макрос, ДополнительныеПараметры.КодЯзыка, Постфикс);

	
КонецПроцедуры
&НаСервере
Функция ИмяМакроса(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаМакросов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат СтрокаТекущая.Макрос;
	
КонецФункции

&НаСервере
Функция ЭтоМакросКонтрольнойДаты(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаМакросов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат СтрНачинаетсяС(НРег(СтрокаТекущая.Макрос), "(кд)");
	
КонецФункции

&НаКлиенте
Процедура ДобавитьМакрос(Макрос, КодЯзыка="", Постфикс="")
	
	Элементы.Шаблон.ВыделенныйТекст = "%"+Макрос+Постфикс+?(ЗначениеЗаполнено(КодЯзыка),"<"+КодЯзыка+">","")+"%";

	ЭтаФорма.ТекущийЭлемент = Элементы.ТаблицаМакросов;
	ЭтаФорма.ТекущийЭлемент = Элементы.Шаблон;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ТекстОшибки = "";
	Если Не ПроверитьСимволыНачалаИОкончанияПовтора(ТекстОшибки) Тогда
		ПоказатьПредупреждение(,ТекстОшибки,,"Ошибка формирования шаблона!");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Шаблон);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВнешниеМакросы(Макросы)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	CW_ПодключаемыеОбъекты.Ссылка КАК Обработка
		|ИЗ
		|	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
		|ГДЕ
		|	CW_ПодключаемыеОбъекты.Вид = &Вид
		|	И НЕ CW_ПодключаемыеОбъекты.ПометкаУдаления
		|	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	Запрос.УстановитьПараметр("Вид", "ВнешнийМакрос");
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 1 Тогда
		Обработка = ТЗ[0].Обработка;
	Иначе
		Возврат Макросы;
	КонецЕсли;	
	
	Структ = Новый Структура("Действие", "СписокМакросов");
	ПараметрыОбработки = Новый Структура("Объект,УИД", ПоместитьВоВременноеХранилище(Структ, ЭтаФорма.УникальныйИдентификатор), ЭтаФорма.УникальныйИдентификатор);
	
	ОбработкаОбъект = _ПО.ПолучитьОбработку(Обработка);
	Если (ОбработкаОбъект = Неопределено) Тогда
		Сообщить("Ошибка подключения внешней команды");
		Возврат(_УФКС.Ответ(1));
	КонецЕсли; 
	
	Попытка
		Ответ = ОбработкаОбъект.ВыполнитьКоманду(Обработка, ПараметрыОбработки);
	Исключение
	КонецПопытки; 
	
	Если Ответ <> Неопределено Тогда
		спДопМакросов = ПолучитьИзВременногоХранилища(Ответ.Адрес);
		
		Для Каждого СтрМакросов из спДопМакросов Цикл
			Макросы.Добавить(СтрМакросов.Значение, СтрМакросов.Представление);
		КонецЦикла;	
	КонецЕсли;	
	
	ОбработкаОбъект = Неопределено;
	
	Возврат Макросы;
	
КонецФункции	

&НаКлиенте
Процедура КомандаДобавитьПереводСтроки(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "%НоваяСтрока%";

КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьНачалоПовторенияМакросов(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "{";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьОкончаниеПовторенияМакросов(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "}";
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСимволыНачалаИОкончанияПовтора(ТекстОшибки)
	
	ЕстьНачало 		= СтрНайти(Шаблон,"{") <> 0;
	ЕстьОкончание 	= СтрНайти(Шаблон,"}") <> 0;
	
	Если ЕстьНачало и Не ЕстьОкончание Тогда
		ТекстОшибки = "В тексте шаблона есть символ начала повтора ""{"" и нет символа окончания повтора ""}""";
	Иначеесли Не ЕстьНачало и ЕстьОкончание Тогда
		ТекстОшибки = "В тексте шаблона есть символ окончания повтора ""}"" и символа начала повтора ""{""";
	Иначе
		ТекстОшибки = "";
	КонецЕсли;
	
	Возврат ЕстьНачало = ЕстьОкончание;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьВариантГруппировкиПоГрузопереозвкам(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "%ГрГП%}";
	
КонецПроцедуры
